app/controllers/images_controller.rb

INSERT INTO "images" ("file", "name", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["file", "<44279 bytes of binary data>"], ["name", "Black"], ["code", "0"], ["created_at", "2017-03-12 18:34:21.862817"], ["updated_at", "2017-03-12 18:34:21.862817"]]
---
  def create
    @image = Image.new(image_params)
    respond_to do |format|
      #if @image.save
      if @image.file.length > 0
        data = File.read(@image.file)
        Image.create file: data, name: @image.name , code:@image.code

UPDATE "images" SET "name" = $1, "file" = $2, "updated_at" = $3 WHERE "images"."id" = $4  [["name", "black"], ["file", "<44279 bytes of binary data>"], ["updated_at", "2017-03-13 01:48:18.968678"], ["id", 13]]
---
  def update

    puts "UPDAAAAAAAAAAAAATE"
    data = File.read(image_params[:file])
    image_params_clone = image_params.clone
    image_params_clone[:file] = data


    respond_to do |format|
      if @image.update(image_params_clone)

DELETE FROM "images" WHERE "images"."id" = $1  [["id", 1]]
---
  def destroy
    @image.destroy